results/freebsd/fileio_low.txt
Running 1m test @ http://192.168.122.142:3000/fileio
  4 threads and 50 connections
  Thread calibration: mean lat.: 0.962ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.968ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.956ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.927ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  424.31us   7.58ms   66.28%
    Req/Sec   524.23     94.31   800.00     68.36%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.95ms
 75.000%    1.22ms
 90.000%    1.49ms
 99.000%    1.98ms
 99.900%    2.52ms
 99.990%    4.82ms
 99.999%    6.80ms
100.000%    7.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.075     0.000000            1         1.00
       0.388     0.100000        10012         1.11
       0.547     0.200000        19982         1.25
       0.693     0.300000        30001         1.43
       0.823     0.400000        39989         1.67
       0.948     0.500000        49994         2.00
       1.004     0.550000        55002         2.22
       1.059     0.600000        59992         2.50
       1.111     0.650000        64946         2.86
       1.166     0.700000        69939         3.33
       1.224     0.750000        74956         4.00
       1.255     0.775000        77428         4.44
       1.292     0.800000        79966         5.00
       1.332     0.825000        82403         5.71
       1.379     0.850000        84929         6.67
       1.432     0.875000        87399         8.00
       1.461     0.887500        88667         8.89
       1.491     0.900000        89907        10.00
       1.526     0.912500        91152        11.43
       1.565     0.925000        92415        13.33
       1.609     0.937500        93645        16.00
       1.634     0.943750        94263        17.78
       1.663     0.950000        94889        20.00
       1.695     0.956250        95512        22.86
       1.732     0.962500        96141        26.67
       1.771     0.968750        96759        32.00
       1.795     0.971875        97075        35.56
       1.817     0.975000        97381        40.00
       1.843     0.978125        97703        45.71
       1.870     0.981250        98018        53.33
       1.901     0.984375        98318        64.00
       1.920     0.985938        98472        71.11
       1.941     0.987500        98635        80.00
       1.964     0.989062        98787        91.43
       1.991     0.990625        98944       106.67
       2.022     0.992188        99099       128.00
       2.040     0.992969        99177       142.22
       2.057     0.993750        99257       160.00
       2.075     0.994531        99331       182.86
       2.105     0.995313        99409       213.33
       2.135     0.996094        99487       256.00
       2.155     0.996484        99529       284.44
       2.181     0.996875        99566       320.00
       2.215     0.997266        99604       365.71
       2.249     0.997656        99644       426.67
       2.289     0.998047        99681       512.00
       2.317     0.998242        99702       568.89
       2.369     0.998437        99721       640.00
       2.419     0.998633        99740       731.43
       2.471     0.998828        99759       853.33
       2.543     0.999023        99779      1024.00
       2.617     0.999121        99789      1137.78
       2.653     0.999219        99799      1280.00
       2.721     0.999316        99808      1462.86
       2.783     0.999414        99818      1706.67
       2.877     0.999512        99828      2048.00
       2.907     0.999561        99833      2275.56
       2.939     0.999609        99837      2560.00
       2.991     0.999658        99842      2925.71
       3.173     0.999707        99847      3413.33
       3.385     0.999756        99852      4096.00
       3.525     0.999780        99855      4551.11
       3.545     0.999805        99857      5120.00
       3.649     0.999829        99859      5851.43
       3.715     0.999854        99862      6826.67
       4.315     0.999878        99864      8192.00
       4.815     0.999890        99866      9102.22
       4.839     0.999902        99867     10240.00
       4.899     0.999915        99868     11702.86
       5.131     0.999927        99869     13653.33
       5.191     0.999939        99870     16384.00
       5.255     0.999945        99871     18204.44
       5.275     0.999951        99872     20480.00
       5.275     0.999957        99872     23405.71
       5.423     0.999963        99873     27306.67
       5.423     0.999969        99873     32768.00
       6.079     0.999973        99874     36408.89
       6.079     0.999976        99874     40960.00
       6.079     0.999979        99874     46811.43
       6.803     0.999982        99875     54613.33
       6.803     0.999985        99875     65536.00
       6.803     0.999986        99875     72817.78
       6.803     0.999988        99875     81920.00
       6.803     0.999989        99875     93622.86
       7.587     0.999991        99876    109226.67
       7.587     1.000000        99876          inf
#[Mean    =        0.946, StdDeviation   =        0.424]
#[Max     =        7.584, Total count    =        99876]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119968 requests in 1.00m, 15.45MB read
Requests/sec:   1999.39
Transfer/sec:    263.59KB