results/freebsd/syscall_low.txt
Running 1m test @ http://192.168.122.142:3000/syscall
  4 threads and 50 connections
  Thread calibration: mean lat.: 2193.657ms, rate sampling interval: 8101ms
  Thread calibration: mean lat.: 2212.972ms, rate sampling interval: 7864ms
  Thread calibration: mean lat.: 2205.629ms, rate sampling interval: 7626ms
  Thread calibration: mean lat.: 2100.878ms, rate sampling interval: 7938ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    15.36s     6.47s   30.11s    58.37%
    Req/Sec   280.12     11.13   294.00     75.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.34s 
 75.000%   20.96s 
 90.000%   24.15s 
 99.000%   26.98s 
 99.900%   29.07s 
 99.990%   29.98s 
 99.999%   30.11s 
100.000%   30.13s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    3510.271     0.000000            1         1.00
    6496.255     0.100000         5615         1.11
    8724.479     0.200000        11231         1.25
   10821.631     0.300000        16838         1.43
   12910.591     0.400000        22447         1.67
   15335.423     0.500000        28042         2.00
   16556.031     0.550000        30846         2.22
   17711.103     0.600000        33643         2.50
   18808.831     0.650000        36463         2.86
   19906.559     0.700000        39272         3.33
   20955.135     0.750000        42062         4.00
   21512.191     0.775000        43493         4.44
   22003.711     0.800000        44869         5.00
   22495.231     0.825000        46282         5.71
   23035.903     0.850000        47680         6.67
   23560.191     0.875000        49092         8.00
   23855.103     0.887500        49782         8.89
   24150.015     0.900000        50458        10.00
   24461.311     0.912500        51184        11.43
   24788.991     0.925000        51895        13.33
   25083.903     0.937500        52576        16.00
   25264.127     0.943750        52939        17.78
   25460.735     0.950000        53268        20.00
   25624.575     0.956250        53614        22.86
   25804.799     0.962500        53969        26.67
   26034.175     0.968750        54330        32.00
   26148.863     0.971875        54504        35.56
   26296.319     0.975000        54681        40.00
   26394.623     0.978125        54841        45.71
   26509.311     0.981250        55022        53.33
   26656.767     0.984375        55194        64.00
   26705.919     0.985938        55282        71.11
   26787.839     0.987500        55371        80.00
   26918.911     0.989062        55455        91.43
   27033.599     0.990625        55536       106.67
   27262.975     0.992188        55638       128.00
   27312.127     0.992969        55681       142.22
   27344.895     0.993750        55713       160.00
   27394.047     0.994531        55757       182.86
   27475.967     0.995313        55804       213.33
   27607.039     0.996094        55845       256.00
   27721.727     0.996484        55864       284.44
   27918.335     0.996875        55887       320.00
   28082.175     0.997266        55908       365.71
   28196.863     0.997656        55931       426.67
   28295.167     0.998047        55952       512.00
   28393.471     0.998242        55964       568.89
   28426.239     0.998437        55974       640.00
   28786.687     0.998633        55986       731.43
   28852.223     0.998828        55996       853.33
   29081.599     0.999023        56007      1024.00
   29130.751     0.999121        56013      1137.78
   29196.287     0.999219        56018      1280.00
   29261.823     0.999316        56024      1462.86
   29343.743     0.999414        56029      1706.67
   29409.279     0.999512        56035      2048.00
   29442.047     0.999561        56037      2275.56
   29474.815     0.999609        56040      2560.00
   29655.039     0.999658        56042      2925.71
   29720.575     0.999707        56045      3413.33
   29753.343     0.999756        56048      4096.00
   29786.111     0.999780        56049      4551.11
   29900.799     0.999805        56051      5120.00
   29949.951     0.999829        56052      5851.43
   29966.335     0.999854        56054      6826.67
   29982.719     0.999878        56055      8192.00
   29982.719     0.999890        56055      9102.22
   29999.103     0.999902        56056     10240.00
   30015.487     0.999915        56057     11702.86
   30015.487     0.999927        56057     13653.33
   30097.407     0.999939        56058     16384.00
   30097.407     0.999945        56058     18204.44
   30113.791     0.999951        56060     20480.00
   30113.791     0.999957        56060     23405.71
   30113.791     0.999963        56060     27306.67
   30113.791     0.999969        56060     32768.00
   30113.791     0.999973        56060     36408.89
   30113.791     0.999976        56060     40960.00
   30113.791     0.999979        56060     46811.43
   30113.791     0.999982        56060     54613.33
   30130.175     0.999985        56061     65536.00
   30130.175     1.000000        56061          inf
#[Mean    =    15357.500, StdDeviation   =     6468.407]
#[Max     =    30113.792, Total count    =        56061]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  67367 requests in 1.00m, 9.64MB read
Requests/sec:   1122.66
Transfer/sec:    164.45KB